// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.


// Console.WriteLine("Сколько чисел будет?");
// int m = Convert.ToInt32(Console.ReadLine());
// int[] array = new int [m];
// int n=0;// счетчик чисел >0
// Console.WriteLine("Введите массив");
// for (int i = 0; i<m; i++)
// {
//     array[i]=Convert.ToInt32(Console.ReadLine());
// }
// for (int i = 0; i<m; i++)
// {
//     if (array[i]>0)
//     {
//         n++;
//     }
// }
// Console.WriteLine(n);

//Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями 
// y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

// Console.WriteLine("Введите переменную b1: ");
// int b1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите переменную k1: ");
// int k1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите переменную b2: ");
// int b2 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите переменную k2: ");
// int k2 = Convert.ToInt32(Console.ReadLine());

// int x = -(b1 - b2) / (k1 - k2);
// int y = k1 * x + b1;

// Console.Write($"Точка пересечения двух прямых: [{x},{y}]");